Revit 2021.1 API
Definition Properties
The Definition type exposes the following members.
Properties
Name | Description
Name
The user visible name for the parameter.
ParameterGroup
 Returns the group ID of the parameter definition.
ParameterType
Returns the user visible interpretation of the parameter data.
UnitType |  Obsolete.
 Returns the UnitType of the parameter definition.
See Also
Definition Class
Autodesk.Revit.DB Namespace